Repository: morningpython/neuro-early-detection
Catalog: mobile_app/lib/l10n/app_*.arb
Languages: sw

# welcomeGreeting
source: Hello!
sw: Habari!

source: Community Health Worker
sw: Mfanyakazi wa Afya ya Jamii

# welcomeMessage
source: Start early Parkinson's disease screening through voice analysis.
sw: Anza uchunguzi wa mapema wa ugonjwa wa Parkinson kupitia uchambuzi wa sauti.

source: Start Screening
sw: Anza Uchunguzi

source: Recent Screenings
sw: Uchunguzi wa Hivi Karibuni

# noScreeningsYet
source: No screenings yet. Tap the button above to start.
sw: Hakuna uchunguzi bado. Gusa kitufe hapo juu kuanza.

source: Statistics
sw: Takwimu

source: Total Screenings
sw: Jumla ya Uchunguzi

source: Low Risk
sw: Hatari ya Chini

source: Medium Risk
sw: Hatari ya Wastani

source: High Risk
sw: Hatari Kubwa

# yearsOld
source: {age} years old
sw: Miaka {age}

source: Male
sw: Kiume

source: Female
sw: Kike

source: Other
sw: Nyingine

source: Patient Information
sw: Taarifa za Mgonjwa

source: Patient Age
sw: Umri wa Mgonjwa

source: Patient Gender
sw: Jinsia ya Mgonjwa

source: Consent
sw: Ridhaa

# consentMessage
source: The patient consents to voice recording for Parkinson's disease screening purposes.
sw: Mgonjwa anakubali kurekodi sauti kwa madhumuni ya uchunguzi wa ugonjwa wa Parkinson.

source: Next
sw: Endelea

source: Back
sw: Rudi

source: Cancel
sw: Ghairi

source: Save
sw: Hifadhi

source: Delete
sw: Futa

source: Voice Recording
sw: Kurekodi Sauti

# holdPhoneInstruction
source: Hold phone 6 inches from mouth
sw: Shika simu inchi 6 kutoka kinywani

# sayAhInstruction
source: Say 'Ahhh' clearly for the duration
sw: Sema 'Ahhh' kwa uwazi kwa muda wote

source: Tap to Start
sw: Gusa Kuanza

source: Recording...
sw: Inarekodi...

source: Processing...
sw: Inachakata...

# secondsRemaining
source: {seconds} seconds
sw: Sekunde {seconds}

# analyzing
source: Analyzing voice sample...
sw: Inachambua sampuli ya sauti...

source: Results
sw: Matokeo

source: Risk Assessment
sw: Tathmini ya Hatari

# lowRiskMessage
source: No immediate concern. Continue routine health monitoring.
sw: Hakuna wasiwasi wa haraka. Endelea na ufuatiliaji wa afya wa kawaida.

# mediumRiskMessage
source: Possible early signs detected. We recommend re-screening in 6 months.
sw: Huenda dalili za mapema zimegunduliwa. Tunapendekeza uchunguzi tena baada ya miezi 6.

# highRiskMessage
source: We recommend consultation with a neurologist for further evaluation.
sw: Tunapendekeza mashauriano na daktari wa neva kwa tathmini zaidi.

source: Refer to Hospital
sw: Mpeleke Hospitali

source: Schedule Follow-up
sw: Panga Ufuatiliaji

# saveAndFinish
source: Save & Finish
sw: Hifadhi na Maliza

source: Record Again
sw: Rekodi Tena

source: Confidence
sw: Uhakika

source: View Details
sw: Angalia Maelezo

source: Hide Details
sw: Ficha Maelezo

source: Settings
sw: Mipangilio

source: Language
sw: Lugha

source: Select Language
sw: Chagua Lugha

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: About
sw: Kuhusu

source: Version
sw: Toleo

source: Privacy Policy
sw: Sera ya Faragha

source: Terms of Service
sw: Masharti ya Huduma

# errorOccurred
source: An error occurred
sw: Kosa limetokea

source: Try Again
sw: Jaribu Tena

# screeningSaved
source: Screening saved successfully
sw: Uchunguzi umehifadhiwa kwa mafanikio

source: Confirm Delete
sw: Thibitisha Kufuta

# deleteConfirmMessage
source: Are you sure you want to delete this screening?
sw: Una uhakika unataka kufuta uchunguzi huu?

# pleaseEnterValidAge
source: Please enter a valid age (18-120)
sw: Tafadhali ingiza umri halali (18-120)

# pleaseSelectGender
source: Please select a gender
sw: Tafadhali chagua jinsia

# pleaseProvideConsent
source: Please provide consent to continue
sw: Tafadhali toa ridhaa kuendelea

source: Screening Complete
sw: Uchunguzi Umekamilika

source: Recommended Action
sw: Hatua Inayopendekezwa

source: No Immediate Concern
sw: Hakuna Wasiwasi wa Haraka

# monitorRecommended
source: Monitoring Recommended
sw: Ufuatiliaji Unapendekezwa

source: Consultation Recommended
sw: Mashauriano Yanapendekezwa
